lsmanoel/PSOC_pulseMatchDetector/Psoc_project/pulseDet_2.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "Count_th_Reg_2.h"
#include "Count_th_Reg_1.h"
#include "Clock_1.h"
#include "Pin_3_aliases.h"
#include "Pin_3.h"
#include "isr_match.h"
#include "Control_Reg_1.h"
#include "isr_Rx_1.h"
#include "UART_1.h"
#include "preCounter_Reg_1.h"
#include "preCounter_Reg_2.h"
#include "preCount_th_Reg_3.h"
#include "preCount_th_Reg_2.h"
#include "preCount_th_Reg_1.h"
#include "Clock_4.h"
#include "PWM_1.h"
#include "Clock_5.h"
#include "inputPin_B_1_aliases.h"
#include "inputPin_B_1.h"
#include "inputPin_A_1_aliases.h"
#include "inputPin_A_1.h"
#include "Count_th_Reg_3.h"
#include "Counter_Reg_1.h"
#include "Counter_Reg_2.h"
#include "Counter_Reg_3.h"
#include "Clock_2.h"
#include "Clock_3.h"
#include "preCounter_Reg_3.h"
#include "UART_1_IntClock.h"
#include "cy_em_eeprom.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"

/*[]*/

